{
  "generatedAt": "2025-12-30T08:35:48.000Z",
  "notice": "This changelog is automatically AI-generated from the project’s history. It’s written for players (not developers), so it may occasionally miss nuance or be slightly wrong.",
  "entries": [
    {
      "id": "2025-12-30-fullscreen-double-items",
      "title": "Fullscreen workspace + double items",
      "dateRange": "Dec 29–30, 2025",
      "note": "Summary entry (not a per-commit log).",
      "highlights": [
        "A new fullscreen-style layout makes the whole app feel like one workspace: less wasted space, more room for the graph and panels.",
        "Equipped-item filters now support multiple copies (×2 / ×3), so you can explore “double item” builds and spots.",
        "Filter chips show item copy counts and let you bump an equipped item up/down a copy without redoing your filters.",
        "Header + controls wrap more gracefully, so search/sort/toggles stay usable across screen sizes."
      ],
      "sections": [
        {
          "title": "Added",
          "items": [
            "Multiple-copy equipped items (×2 / ×3) throughout the app: chips, explorer actions, and analysis now understand duplicate items on the same unit."
          ]
        },
        {
          "title": "Improved",
          "items": [
            "Fullscreen layout polish: tighter framing and better use of horizontal space for faster “what if?” exploration.",
            "Top bar layout: search, stats, and controls are easier to reach without squeezing the graph."
          ]
        }
      ]
    },
    {
      "id": "2025-12-28-playbook-necessity-item-view",
      "title": "Playbook + Necessity",
      "dateRange": "Dec 27–28, 2025",
      "highlights": [
        "Explorer Playbook: compute the biggest win drivers (and win killers) inside a comp cluster, with one-click add/exclude.",
        "Items panel now has an Item view: pick an item and see the best champions to hold it in your exact filter context.",
        "New “Most necessary” sorting estimates how much an item changes Top4 odds (with confidence + reliability notes when you expand a row).",
        "Avg placement now shows a quick Δ when your filters change, so you can feel what just happened."
      ],
      "sections": [
        {
          "title": "Added",
          "items": [
            "Playbook for clusters: see top win drivers (Δ win / Δ top4) and win killers (Δ win / Δ 8th) within the selected cluster.",
            "Comp view in Explorer: active trait tiers plus “best holder” hints for key items, with quick equip buttons.",
            "Item view in the Items panel: explore an item directly to find the best unit holders (not just “best items for a unit”).",
            "“Most necessary (AIPW)” sorting: a causal-style estimate of how much an item increases Top4 chance, with expandable detail (CI, sample sizes, trimming/warnings)."
          ]
        },
        {
          "title": "Improved",
          "items": [
            "Cleaner stats readouts (less duplication) across Explorer and Items.",
            "Explorer visuals: clearer signature previews and placement distribution snapshots.",
            "Smoother scrolling with consistent scrollbars across the app."
          ]
        },
        {
          "title": "Fixed",
          "items": [
            "Small UI and layout edge cases in the Explorer and Items panels."
          ]
        }
      ]
    },
    {
      "id": "2025-12-27-exclusions-stars-voice",
      "title": "Smarter filtering: exclusions + star levels",
      "dateRange": "Dec 26–27, 2025",
      "note": "Summary entry (not a per-commit log).",
      "highlights": [
        "Exclude units/items/traits to remove games that match (e.g. “-Demacia 5”).",
        "Filter by unit star level (2★ / 3★) when it matters for your question.",
        "Voice input understands include vs exclude and can trigger common actions.",
        "Walkthrough updated with exclusion-focused guidance."
      ],
      "sections": [
        {
          "title": "Added",
          "items": [
            "Exclude filters across the app (not just “include”): quickly answer “what if I avoid X?”. Tip: type “-” before a term, or Alt/Option-click a suggestion to exclude it.",
            "Exclusions for equipped items too (exclude “Unit + Item” situations without throwing out the whole unit).",
            "Unit star-level filters (and a selector) so you can compare 1★ vs 2★ vs 3★ contexts."
          ]
        },
        {
          "title": "Improved",
          "items": [
            "Voice input: clearer feedback when it’s busy, plus safeguards against accidental rapid re-triggers.",
            "Search: more forgiving matching (name normalization) so you can find things with fewer “exact spelling” misses."
          ]
        },
        {
          "title": "Fixed",
          "items": [
            "Small interaction edge cases around exclusion flows and walkthrough steps."
          ]
        }
      ]
    },
    {
      "id": "2025-12-26-items-clusters-filters",
      "title": "Deeper answers: item builds + comp explorer",
      "dateRange": "Dec 24–26, 2025",
      "highlights": [
        "Item Explorer: see best items (and full builds) for a unit in your exact filter context.",
        "Cluster Explorer: discover high-performing “packages” of units/items/traits from your current spot.",
        "Placement histograms and clearer summaries for “how good is this, and how often?”."
      ],
      "sections": [
        {
          "title": "Added",
          "items": [
            "Item Explorer with one-click “apply build” and “equip item on unit” flows.",
            "Build search that can show partial builds when a full 3-item set isn’t strongly supported.",
            "Cluster Explorer with top-4 rate, average placement, and a placement distribution histogram.",
            "Global item filters: limit suggestions to components, completed items, artifacts, emblems, or radiant items.",
            "Item “set/prefix” filters to focus suggestions on a specific theme when items have multiple variants."
          ]
        },
        {
          "title": "Improved",
          "items": [
            "Stats readouts and sorting options to make it easier to answer: “most impactful”, “most helpful”, or “most harmful”.",
            "Walkthrough and UI polish around items (including an item-focused tour).",
            "Multi-add: add several filters quickly without restarting your flow each time."
          ]
        },
        {
          "title": "Fixed",
          "items": [
            "Search and mic UI overflow issues on smaller screens.",
            "Startup hiccups around loading names/icons so the UI stays usable even if assets are slow."
          ]
        }
      ]
    },
    {
      "id": "2025-12-21-launch-graph",
      "title": "Launch: interactive placement graph",
      "dateRange": "Dec 20–21, 2025",
      "highlights": [
        "Search for units/items/traits, add them as filters, and watch the graph update around your context.",
        "Tooltips show sample sizes and how much a node changes average placement from your current filters.",
        "Touch/drag interactions and automatic framing to keep exploration smooth."
      ],
      "sections": [
        {
          "title": "Added",
          "items": [
            "Interactive graph exploration with unit, item, and trait nodes.",
            "Sorting controls (Impact / Helpful / Harmful) and a Top-K limit to control graph density.",
            "Clear-all and quick filter editing to iterate on “what if?” questions faster."
          ]
        },
        {
          "title": "Improved",
          "items": [
            "Better readability with hover interactions, stronger visual hierarchy, and placement-based color cues.",
            "Search quality-of-life improvements as the list of things you can search grew."
          ]
        }
      ]
    }
  ]
}
